# Задание №6
# 📌 Доработайте классы исключения так, чтобы они выдали подробную информацию об ошибках.
# 📌 Передавайте необходимые данные из основного кода проекта.



# ДЗ
# Задание
# 📌 Решить задачи, которые не успели решить на семинаре.
# 📌 Возьмите 1-3 задачи из тех, что были на прошлых семинарах или в домашних заданиях. Напишите к ним классы исключения с выводом подробной информации.
# Поднимайте исключения внутри основного кода. Например нельзя создавать прямоугольник со сторонами отрицательной длины.

# Доделать два метода из задания №5
# 3 задачи
# Собственные исключения
# Исключения в отдельный модуль

