# Задание №8
# ✔ Создайте несколько переменных заканчивающихся и не оканчивающихся на «s».
# ✔ Напишите функцию, которая при запуске заменяет содержимое переменных
# оканчивающихся на s (кроме переменной из одной буквы s) на None.
# ✔ Значения не удаляются, а помещаются в одноимённые переменные без s на конце.



# globals()

# names = 'Иван', -> name = 'Иван', names = None
#
# ч/з глобальные переменные

# словарь глобальных переменных
# его меняем



# ДЗ
# 1. Транспонирование матрицы. Список списков. Самостоятельный код.
# 2. Встроенная функция ???. **kwargs Хэшируемость ??? hash()
# 3. Несколько функций. Список. Логирование в файл. М.б. через декораторы.



